run/tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            (sampling);
interpolationScheme cellPointFace;
setFormat       raw;

fields          ( T U );

sets
{
    y0.1
    {
        type            face;
        axis            x;
        start           (-1 0.218 0);
        end             (1 0.218 0);
    }
    y0.2
    {
        type            face;
        axis            x;
        start           (-1 0.436 0);
        end             (1 0.436 0);
    }
    y0.3
    {
        type            face;
        axis            x;
        start           (-1 0.654 0);
        end             (1 0.654 0);
    }
    y0.4
    {
        type            face;
        axis            x;
        start           (-1 0.872 0);
        end             (1 0.872 0);
    }
    y0.5
    {
        type            face;
        axis            x;
        start           (-1 1.09 0);
        end             (1 1.09 0);
    }
    y0.6
    {
        type            face;
        axis            x;
        start           (-1 1.308 0);
        end             (1 1.308 0);
    }
    y0.7
    {
        type            face;
        axis            x;
        start           (-1 1.526 0);
        end             (1 1.526 0);
    }
    y0.8
    {
        type            face;
        axis            x;
        start           (-1 1.744 0);
        end             (1 1.744 0);
    }
    y0.9
    {
        type            face;
        axis            x;
        start           (-1 1.962 0);
        end             (1 1.962 0);
    }
}


// ************************************************************************* //
